app/views/users/show.html.erb

<ul>
  <% @user.addresses.each do |address| %>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ?  [["user_id", 1]]