app/controllers/users_controller.rb

INSERT INTO "users" ("name", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "3wewwe"], ["phone", "fgjhn"], ["created_at", "2023-08-24 22:09:27.351592"], ["updated_at", "2023-08-24 22:09:27.351592"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save